Tekla Open API Reference for Tekla Structures 2025
Events.CommandStatusChange Event
 The CommandStatusChange event is raised when a command is started/ended.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public event Events.CommandStatusChangeDelegate CommandStatusChange
Public Event CommandStatusChange As Events.CommandStatusChangeDelegate
Value
Type: Tekla.Structures.Model.Events.CommandStatusChangeDelegate
Implements
IEvents.CommandStatusChange
See Also
Reference
Events Class
Tekla.Structures.Model Namespace